
// ================================================================//
//                           close
// ================================================================//
//  UNPV -- 94 page


#include <unistd.h>


int close( int sockfd );
    //-- 只有 引用计数值 减为0，此 sockfd 才会被真正关闭
    //-- 所以，在 并发服务器中，父进程调用 close(connfd); 并不会真的关闭这个 sockfd
    //-- 只会将其 引用计数值 减1

    //-- 这个特性会让 close 函数的结果不是那么干脆有效
    //-- 如果想立即关闭某 sockfd，可以使用函数 shutdown

    //--renturn
    //-- 成功，返回 0
    //-- 出错，返回 -1











