/*

    ===================================================================
                        
    ===================================================================:

    
    调用每个 active render pass 的 OnCameraSetup() 函数;

   

    disable 所有 "逐相机 shader keywords";

    配置了与 camera 相关的 shader 变量;

    配置了与 time 相关的 shader 变量;

    依据 "RenderPassEvent" 
    对所有 active render passes 进行排序;


    绘制 editor 中的界面图标; 在特效之后;

    执行收尾清理工作

    -1-
    -2-
    -3-
    -4-


    ================================= oth ==================================


    editor: 绘制线框
   







*/
